12/data/attachments/4ac56bd7e920f0dd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:username>
            <nif:friendToBeAdded>Elaine_throughout_Friend_48569_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>